# A191 Stock Factors 001-020

In [1]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [2]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 001

Formula:

`(-1 * CORR(RANK(DELTA(LOG(VOLUME), 1)), RANK(((CLOSE -OPEN) / OPEN)), 6))`

In [3]:
sql_alpha_001 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * m_corr(c_pct_rank(m_delta(log(volume), 1)), c_pct_rank(((close -open) / open)), 6)) 
    AS alpha_a191_f0001
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_001), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0001
35474   2023-01-12  000001.SZ          0.872261
35475   2023-01-12  000002.SZ          0.282539
35476   2023-01-12  000004.SZ          0.631278
35477   2023-01-12  000005.SZ         -0.409429
35478   2023-01-12  000006.SZ         -0.296828
...            ...        ...               ...
3858341 2025-12-26  688800.SH         -0.672789
3858342 2025-12-26  688802.SH          0.343178
3858345 2025-12-26  688819.SH         -0.429740
3858346 2025-12-26  688981.SH         -0.611076
3858347 2025-12-26  689009.SH          0.299794

[3636993 rows x 3 columns]

## A191 Factor 002

Formula:

`(-1 * DELTA((((CLOSE -LOW) -(HIGH -CLOSE)) / (HIGH -LOW)), 1))`

In [4]:
sql_alpha_002 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * m_delta((((close -low) -(high -close)) / (high -low)), 1)) 
    AS alpha_a191_f0002
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_002), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0002
10134   2023-01-05  000001.SZ          1.152241
10135   2023-01-05  000002.SZ          0.170134
10136   2023-01-05  000004.SZ          1.161905
10137   2023-01-05  000005.SZ          0.333333
10138   2023-01-05  000006.SZ          0.397213
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.993231
3858344 2025-12-26  688807.SH          0.125221
3858345 2025-12-26  688819.SH          0.894428
3858346 2025-12-26  688981.SH         -0.265654
3858347 2025-12-26  689009.SH          1.237846

[3651537 rows x 3 columns]

## A191 Factor 003

Formula:

`SUM((CLOSE=DELAY(CLOSE,1)?0:CLOSE-(CLOSE>DELAY(CLOSE,1)?MIN(LOW,DELAY(CLOSE,1)):MAX(HIGH,DELAY(CLOSE,1)))),6)`

In [5]:
sql_alpha_003 = f"""--sql
SELECT
    date,
    instrument,
    m_sum((IF(close=m_lag(close,1),0,close-(IF(close>m_lag(close,1),least(low,m_lag(close,1)),greatest(high,m_lag(close,1)))))),6) 
    AS alpha_a191_f0003
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_003), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0003
30405   2023-01-11  000001.SZ         35.320225
30406   2023-01-11  000002.SZ        -82.955530
30407   2023-01-11  000004.SZ         -3.494921
30408   2023-01-11  000005.SZ         -0.834084
30409   2023-01-11  000006.SZ        -37.771362
...            ...        ...               ...
3858341 2025-12-26  688800.SH         13.377783
3858342 2025-12-26  688802.SH       -182.150000
3858345 2025-12-26  688819.SH          2.023017
3858346 2025-12-26  688981.SH          3.880000
3858347 2025-12-26  689009.SH          0.681946

[3642292 rows x 3 columns]

## A191 Factor 004

Formula:

`((((SUM(CLOSE, 8) / 8) + STD(CLOSE, 8)) < (SUM(CLOSE, 2) / 2)) ? (-1 * 1) : (((SUM(CLOSE, 2) / 2) <((SUM(CLOSE, 8) / 8) -STD(CLOSE, 8))) ? 1 : (((1 < (VOLUME / MEAN(VOLUME,20))) || ((VOLUME /MEAN(VOLUME,20)) == 1)) ? 1 : (-1 * 1))))`

In [6]:
sql_alpha_004 = f"""--sql
SELECT
    date,
    instrument,
    (IF((((m_sum(close, 8) / 8) + m_stddev(close, 8)) < (m_sum(close, 2) / 2)), (-1 * 1), (IF(((m_sum(close, 2) / 2) < ((m_sum(close, 8) / 8) - m_stddev(close, 8))), 1, (IF(((1 < (volume / m_avg(volume,20))) OR ((volume / m_avg(volume,20)) == 1)), 1, (-1 * 1))))))) 
    AS alpha_a191_f0004
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_004), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0004
5067    2023-01-04  000001.SZ              -1.0
5068    2023-01-04  000002.SZ              -1.0
5069    2023-01-04  000004.SZ              -1.0
5070    2023-01-04  000005.SZ              -1.0
5071    2023-01-04  000006.SZ              -1.0
...            ...        ...               ...
3858343 2025-12-26  688805.SH              -1.0
3858344 2025-12-26  688807.SH              -1.0
3858345 2025-12-26  688819.SH              -1.0
3858346 2025-12-26  688981.SH               1.0
3858347 2025-12-26  689009.SH               1.0

[3668803 rows x 3 columns]

## A191 Factor 005

Formula:

`(-1 * TSMAX(CORR(TSRANK(VOLUME, 5), TSRANK(HIGH, 5), 5), 3))`

In [7]:
sql_alpha_005 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * m_max(m_corr(m_rank(volume, 5), m_rank(high, 5), 5), 3)) 
    AS alpha_a191_f0005
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_005), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0005
55750   2023-01-18  000001.SZ         -0.870864
55751   2023-01-18  000002.SZ         -0.559017
55752   2023-01-18  000004.SZ         -0.727607
55753   2023-01-18  000005.SZ         -0.978700
55754   2023-01-18  000006.SZ         -0.612372
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.840168
3858341 2025-12-26  688800.SH         -0.720750
3858345 2025-12-26  688819.SH         -0.422577
3858346 2025-12-26  688981.SH         -0.975900
3858347 2025-12-26  689009.SH         -0.464286

[3290215 rows x 3 columns]

## A191 Factor 006

Formula:

`(RANK(SIGN(DELTA((((OPEN * 0.85) + (HIGH * 0.15))), 4)))* -1)`

In [8]:
sql_alpha_006 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(sign(m_delta((((open * 0.85) + (high * 0.15))), 4)))* -1) 
    AS alpha_a191_f0006
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_006), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0006
25337   2023-01-10  000001.SZ         -0.682737
25338   2023-01-10  000002.SZ         -0.682737
25339   2023-01-10  000004.SZ         -0.181920
25340   2023-01-10  000005.SZ         -0.682737
25341   2023-01-10  000006.SZ         -0.181920
...            ...        ...               ...
3858342 2025-12-26  688802.SH         -0.165019
3858344 2025-12-26  688807.SH         -0.165019
3858345 2025-12-26  688819.SH         -0.666182
3858346 2025-12-26  688981.SH         -0.666182
3858347 2025-12-26  689009.SH         -0.666182

[3647592 rows x 3 columns]

## A191 Factor 007

Formula:

`((RANK(MAX((VWAP -CLOSE), 3)) + RANK(MIN((VWAP -CLOSE), 3))) * RANK(DELTA(VOLUME, 3)))`

In [9]:
sql_alpha_007 = f"""--sql
SELECT
    date,
    instrument,
    ((c_pct_rank(m_max((vwap -close), 3)) + c_pct_rank(m_min((vwap -close), 3))) * c_pct_rank(m_delta(volume, 3))) 
    AS alpha_a191_f0007
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_007), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0007
20269   2023-01-09  000001.SZ          0.000024
20270   2023-01-09  000002.SZ          0.000105
20271   2023-01-09  000004.SZ          0.234217
20272   2023-01-09  000005.SZ          0.345227
20273   2023-01-09  000006.SZ          0.000610
...            ...        ...               ...
3858342 2025-12-26  688802.SH          0.435617
3858344 2025-12-26  688807.SH          0.441680
3858345 2025-12-26  688819.SH          0.743942
3858346 2025-12-26  688981.SH          0.180750
3858347 2025-12-26  689009.SH          1.328486

[3652892 rows x 3 columns]

## A191 Factor 008

Formula:

`RANK(DELTA(((((HIGH + LOW) / 2) * 0.2) + (VWAP * 0.8)), 4) * -1)`

In [10]:
sql_alpha_008 = f"""--sql
SELECT
    date,
    instrument,
    c_pct_rank(m_delta(((((high + low) / 2) * 0.2) + (vwap * 0.8)), 4) * -1) 
    AS alpha_a191_f0008
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_008), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0008
25337   2023-01-10  000001.SZ          0.010623
25338   2023-01-10  000002.SZ          0.053524
25339   2023-01-10  000004.SZ          0.853524
25340   2023-01-10  000005.SZ          0.567722
25341   2023-01-10  000006.SZ          0.991216
...            ...        ...               ...
3858342 2025-12-26  688802.SH          0.999806
3858344 2025-12-26  688807.SH          0.999031
3858345 2025-12-26  688819.SH          0.196318
3858346 2025-12-26  688981.SH          0.066473
3858347 2025-12-26  689009.SH          0.947481

[3647592 rows x 3 columns]

## A191 Factor 009

Formula:

`SMA(((HIGH+LOW)/2-(DELAY(HIGH,1)+DELAY(LOW,1))/2)*(HIGH-LOW)/VOLUME,7,2)`

In [11]:
sql_alpha_009 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(((high+low)/2-(m_lag(high,1)+m_lag(low,1))/2)*(high-low)/volume,7,2) 
    AS alpha_a191_f0009
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_009), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0009
10134   2023-01-05  000001.SZ      1.528537e-05
10135   2023-01-05  000002.SZ      1.265037e-04
10136   2023-01-05  000004.SZ     -2.576975e-08
10137   2023-01-05  000005.SZ      2.689646e-08
10138   2023-01-05  000006.SZ     -7.652857e-07
...            ...        ...               ...
3858343 2025-12-26  688805.SH     -2.103616e-07
3858344 2025-12-26  688807.SH     -2.522966e-05
3858345 2025-12-26  688819.SH      9.163124e-08
3858346 2025-12-26  688981.SH      4.552844e-08
3858347 2025-12-26  689009.SH     -4.058730e-08

[3663499 rows x 3 columns]

## A191 Factor 010

Formula:

`(RANK(MAX(((RET < 0) ? STD(RET, 20) : CLOSE)^2),5))`

In [12]:
sql_alpha_010 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_max(IF(ret < 0, m_stddev(ret, 20), close)^2, 5))) 
    AS alpha_a191_f0010
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_010), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0010
25347   2023-01-10  000012.SZ          0.940299
25360   2023-01-10  000030.SZ          0.203980
25375   2023-01-10  000050.SZ          0.786070
25386   2023-01-10  000068.SZ          0.034826
25473   2023-01-10  000550.SZ          0.701493
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.716227
3858341 2025-12-26  688800.SH          0.888005
3858345 2025-12-26  688819.SH          0.422166
3858346 2025-12-26  688981.SH          0.841615
3858347 2025-12-26  689009.SH          0.638781

[3557710 rows x 3 columns]

## A191 Factor 011

Formula:

`SUM(((CLOSE-LOW)-(HIGH-CLOSE))./(HIGH-LOW).*VOLUME,6)`

In [13]:
sql_alpha_011 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(((close-low)-(high-close))/(high-low)*volume,6) 
    AS alpha_a191_f0011
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_011), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0011
30405   2023-01-11  000001.SZ      1.093542e+08
30406   2023-01-11  000002.SZ      1.076269e+07
30407   2023-01-11  000004.SZ     -3.704191e+06
30408   2023-01-11  000005.SZ     -8.093678e+06
30409   2023-01-11  000006.SZ     -2.249882e+08
...            ...        ...               ...
3858341 2025-12-26  688800.SH      1.794561e+06
3858342 2025-12-26  688802.SH     -1.307007e+07
3858345 2025-12-26  688819.SH      4.715162e+06
3858346 2025-12-26  688981.SH     -3.542120e+04
3858347 2025-12-26  689009.SH     -5.082217e+06

[3616286 rows x 3 columns]

## A191 Factor 012

Formula:

`(RANK((OPEN -(SUM(VWAP, 10) / 10)))) * (-1 * (RANK(ABS((CLOSE -VWAP)))))`

In [14]:
sql_alpha_012 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank((open -(m_sum(vwap, 10) / 10)))) * (-1 * (c_pct_rank(abs((close -vwap))))) 
    AS alpha_a191_f0012
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_012), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0012
50681   2023-01-17  000001.SZ         -0.991030
50682   2023-01-17  000002.SZ         -0.994694
50683   2023-01-17  000004.SZ         -0.429676
50684   2023-01-17  000005.SZ         -0.243600
50685   2023-01-17  000006.SZ         -0.913480
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.294337
3858341 2025-12-26  688800.SH         -0.679702
3858345 2025-12-26  688819.SH         -0.047425
3858346 2025-12-26  688981.SH         -0.025806
3858347 2025-12-26  689009.SH         -0.029493

[3621102 rows x 3 columns]

## A191 Factor 013

Formula:

`(((HIGH * LOW)^0.5) -VWAP)`

In [15]:
sql_alpha_013 = f"""--sql
SELECT
    date,
    instrument,
    (((high * low)^0.5) -vwap) 
    AS alpha_a191_f0013
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_013), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0013
5067    2023-01-04  000001.SZ       1583.115167
5068    2023-01-04  000002.SZ       3206.842883
5069    2023-01-04  000004.SZ         30.353185
5070    2023-01-04  000005.SZ         15.459305
5071    2023-01-04  000006.SZ        236.027748
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.406720
3858344 2025-12-26  688807.SH          2.557500
3858345 2025-12-26  688819.SH          3.182740
3858346 2025-12-26  688981.SH          0.237593
3858347 2025-12-26  689009.SH          2.209654

[3668803 rows x 3 columns]

## A191 Factor 014

Formula:

`CLOSE-DELAY(CLOSE,5)`

In [16]:
sql_alpha_014 = f"""--sql
SELECT
    date,
    instrument,
    close-m_lag(close,5) 
    AS alpha_a191_f0014
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_014), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0014
30405   2023-01-11  000001.SZ         39.877674
30406   2023-01-11  000002.SZ        -13.825922
30407   2023-01-11  000004.SZ         -2.600872
30408   2023-01-11  000005.SZ         -0.370704
30409   2023-01-11  000006.SZ        -19.080379
...            ...        ...               ...
3858341 2025-12-26  688800.SH         20.521259
3858342 2025-12-26  688802.SH        -95.900000
3858345 2025-12-26  688819.SH          1.224745
3858346 2025-12-26  688981.SH          8.470000
3858347 2025-12-26  689009.SH         -0.981589

[3642292 rows x 3 columns]

## A191 Factor 015

Formula:

`OPEN/DELAY(CLOSE,1)-1`

In [17]:
sql_alpha_015 = f"""--sql
SELECT
    date,
    instrument,
    open/m_lag(close,1)-1 
    AS alpha_a191_f0015
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_015), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0015
10134   2023-01-05  000001.SZ          0.005587
10135   2023-01-05  000002.SZ         -0.003671
10136   2023-01-05  000004.SZ         -0.003012
10137   2023-01-05  000005.SZ          0.010695
10138   2023-01-05  000006.SZ         -0.006494
...            ...        ...               ...
3858343 2025-12-26  688805.SH         -0.005815
3858344 2025-12-26  688807.SH         -0.012367
3858345 2025-12-26  688819.SH         -0.001192
3858346 2025-12-26  688981.SH         -0.004062
3858347 2025-12-26  689009.SH         -0.001185

[3663499 rows x 3 columns]

## A191 Factor 016

Formula:

`(-1 * TSMAX(RANK(CORR(RANK(VOLUME), RANK(VWAP), 5)), 5))`

In [18]:
sql_alpha_016 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * m_max(c_pct_rank(m_corr(c_pct_rank(volume), c_pct_rank(vwap), 5)), 5)) 
    AS alpha_a191_f0016
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_016), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0016
45612   2023-01-16  000001.SZ         -0.378472
45613   2023-01-16  000002.SZ         -0.463534
45614   2023-01-16  000004.SZ         -0.395506
45615   2023-01-16  000005.SZ         -0.849295
45616   2023-01-16  000006.SZ         -0.977946
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.917670
3858341 2025-12-26  688800.SH         -0.813724
3858345 2025-12-26  688819.SH         -0.607558
3858346 2025-12-26  688981.SH         -0.698779
3858347 2025-12-26  689009.SH         -0.776895

[3626398 rows x 3 columns]

## A191 Factor 017

Formula:

`RANK((VWAP -MAX(VWAP, 15)))^DELTA(CLOSE, 5)`

In [19]:
sql_alpha_017 = f"""--sql
SELECT
    date,
    instrument,
    c_pct_rank((vwap - m_max(vwap, 15)))^m_delta(close, 5) 
    AS alpha_a191_f0017
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_017), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0017
76045   2023-01-31  000001.SZ      2.736666e-01
76046   2023-01-31  000002.SZ      1.341657e+63
76047   2023-01-31  000004.SZ      5.128684e-01
76048   2023-01-31  000005.SZ      1.067344e+00
76049   2023-01-31  000006.SZ      7.874201e-08
...            ...        ...               ...
3858340 2025-12-26  688799.SH      2.897236e+00
3858341 2025-12-26  688800.SH      1.055891e-20
3858345 2025-12-26  688819.SH      6.262886e-01
3858346 2025-12-26  688981.SH      2.936391e-07
3858347 2025-12-26  689009.SH      6.280413e+00

[3594624 rows x 3 columns]

## A191 Factor 018

Formula:

`CLOSE/DELAY(CLOSE,5)`

In [20]:
sql_alpha_018 = f"""--sql
SELECT
    date,
    instrument,
    close/m_lag(close,5) 
    AS alpha_a191_f0018
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_018), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0018
30405   2023-01-11  000001.SZ          1.024441
30406   2023-01-11  000002.SZ          0.995805
30407   2023-01-11  000004.SZ          0.935743
30408   2023-01-11  000005.SZ          0.978610
30409   2023-01-11  000006.SZ          0.920455
...            ...        ...               ...
3858341 2025-12-26  688800.SH          1.146645
3858342 2025-12-26  688802.SH          0.865987
3858345 2025-12-26  688819.SH          1.034053
3858346 2025-12-26  688981.SH          1.074540
3858347 2025-12-26  689009.SH          0.983570

[3642292 rows x 3 columns]

## A191 Factor 019

Formula:

`(CLOSE<DELAY(CLOSE,5)?(CLOSE-DELAY(CLOSE,5))/DELAY(CLOSE,5):(CLOSE=DELAY(CLOSE,5)?0:(CLOSE-DELAY(CLOSE,5))/CLOSE))`

In [21]:
sql_alpha_019 = f"""--sql
SELECT
    date,
    instrument,
    (IF(close < m_lag(close, 5), (close - m_lag(close, 5)) / m_lag(close, 5), IF(close = m_lag(close, 5), 0, (close - m_lag(close, 5)) / close))) 
    AS alpha_a191_f0019
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_019), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0019
30405   2023-01-11  000001.SZ          0.023858
30406   2023-01-11  000002.SZ         -0.004195
30407   2023-01-11  000004.SZ         -0.064257
30408   2023-01-11  000005.SZ         -0.021390
30409   2023-01-11  000006.SZ         -0.079545
...            ...        ...               ...
3858341 2025-12-26  688800.SH          0.127891
3858342 2025-12-26  688802.SH         -0.134013
3858345 2025-12-26  688819.SH          0.032931
3858346 2025-12-26  688981.SH          0.069369
3858347 2025-12-26  689009.SH         -0.016430

[3642292 rows x 3 columns]

## A191 Factor 020

Formula:

`(CLOSE-DELAY(CLOSE,6))/DELAY(CLOSE,6)*100`

In [23]:
sql_alpha_020 = f"""--sql
SELECT
    date,
    instrument,
    (close-m_lag(close,6))/m_lag(close,6)*100 
    AS alpha_a191_f0020
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_020), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0020
35474   2023-01-12  000001.SZ          2.444134
35475   2023-01-12  000002.SZ         -2.464604
35476   2023-01-12  000004.SZ         -5.522088
35477   2023-01-12  000005.SZ          2.673797
35478   2023-01-12  000006.SZ        -10.064935
...            ...        ...               ...
3858341 2025-12-26  688800.SH         12.093325
3858342 2025-12-26  688802.SH        -21.261943
3858345 2025-12-26  688819.SH          4.006116
3858346 2025-12-26  688981.SH          8.244681
3858347 2025-12-26  689009.SH          0.459283

[3636993 rows x 3 columns]